--[[ 
▀▄ ▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀          
▀▄ ▄▀                                       ▀▄ ▄▀ 
▀▄ ▄▀       BY ALI NOFEL                    ▀▄ ▄▀ 
▀▄ ▄▀ BY ALI NOFEL (@rafidebot)             ▀▄ ▄▀          
▀▄ ▄▀ JUST WRITED BY ALI NOFEL             ▀▄ ▄▀   
▀▄ ▄▀          مساعدة 3                    ▀▄ ▄▀ 
▀▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀
--]]
do

function run(msg, matches)
local reply_id = msg['id']
local S = [[ 
⚙ أوامر الحماية في المجموعة 🔃

▫️ قفل_فتح الروابط❂لقفل_فتح الروابط🎈
▫️ قفل_فتح اعاده توجيه❂لقفل_فتح التوجيه🎈
▫️ قفل_فتح الملصقات❂لقفل_فتح الملصقات🎈
▫️ قفل_فتح الصور المتحركه❂لقفل_فتح المتحركه🎈
▫️ قفل_فتح الرد❂لقفل_فتح الرد🎈
▫️ قفل_فتح الفيديو❂لقفل_فتح الفيديو🎈
▫️ قفل_فتح الصوت❂لقفل_فتح الصوت🎈
▫️ قفل_فتح الكلايش❂لقفل_فتح الكلايش🎈
▫️ قفل_فتح التكرار❂لقفل_فتح التكرار🎈
▫️ قفل_فتح البوتات❂لقفل_فتح البوتات🎈
▫️ قفل_فتح العربيه❂لقفل_فتح العربيه🎈
▫️ قفل_فتح جهات الاتصال❂لقفل_فتح الجهات🎈
▫️ قفل_فتح الجماعيه❂لقفل_فتح الجماعيه🎈
▫️ قفل_فتح الاصافه❂لقفل_فتح الاصافه🎈
▫️ قفل_فتح الدردشه❂لقفل_فتح الدردشه🎈
▫️ قفل_فتح الوسائط❂لقفل_فتح الوسائط🎈
▫️ قفل_فتح المجموعه❂لقفل_فتح المجموعه🎈
〰〰〰〰〰〰〰〰
🍃dev ««« @ali_nofel
🍃dev bot ««« @rafide_bot
.
]]
reply_msg(reply_id, S, ok_cb, false)
end

return {
description = "Help list", 
usage = "Help list",
patterns = {
"^(م3)$",
},
run = run
}
end
