--[[ 
▀▄ ▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀          
▀▄ ▄▀                                       ▀▄ ▄▀ 
▀▄ ▄▀       BY ALI NOFEL                    ▀▄ ▄▀ 
▀▄ ▄▀ BY ALI NOFEL (@rafidebot)             ▀▄ ▄▀          
▀▄ ▄▀ JUST WRITED BY ALI NOFEL              ▀▄ ▄▀   
▀▄ ▄▀            مساعدة 1                  ▀▄ ▄▀ 
▀▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀
--]]
do

local function run(msg, matches)
local reply_id = msg['id']
if is_momod(msg) and matches[1]== 'م1' then
local S = [[                     ⚙ اوامر الترقية 🔃
                           .  〰〰〰〰〰〰〰〰
▫️رفع المدير ❂ لرفع مدير🎈
▫️رفع ادمن ❂ لرفع ادمن🎈
▫️رفع اداري❂ لرفع اداري🎈
▫️تنزيل ادمن ❂ لتنزيل ادمن🎈
▫️تنزيل اداري❂ لتنزيل اداري🎈
▫️مدير المجموعه ❂ لعرض مدير المجموعه🎈
▫️الادمنيه❂ لعرض قائمة الادمنيه🎈
▫️الاداريين❂ لعرض قائمة الادريين🎈
  〰〰〰〰〰〰〰〰〰〰〰〰〰〰
⚙اوامر الحظر 🔃
                              〰〰〰〰〰〰〰〰
▫️حظر❂ لحظر المستخدم🎈
▫️الغاء الحظر❂ لالغاء الحظر عن المستخدم🎈
▫️منع❂ لمنع كلمة معينة🎈
▫️الغاء منع❂ لالغاء منع كلمة معينة🎈
▫️كتم❂ لكتم المستخدم🎈
▫️كتم❂ لالغاء الكتم عن المستخدم🎈
▫️المكتومين❂ لعرض قائمة المكتومين🎈
▫️حظر عام ❂ لحظر المستخدم عام 🎈

〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰
▫️تاك كلمه❂ لعمل تاك للكل🎈
▫️تصميم❂ لتصميم اسم معين🎈
▫️زخرفة❂ لزخرفه اسم معين بلعربي🎈
▫️write❂ لزخرفه اسم معين بلنكليزي🎈

🍃dev ««« @ali_nofel
🍃dev bot ««« @rafide_bot
.
]]
reply_msg(reply_id, S, ok_cb, false) 
end

if not is_momod(msg) then
local S = "  للـمـشـرفـيـن فـقـط 😒🖕🏿"
reply_msg(reply_id, S, ok_cb, false)
end

end
return {
description = "Help list", 
usage = "Help list",
patterns = {
"^(م1)$",
},
run = run
}
end
