--[[ 
▀▄ ▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀          
▀▄ ▄▀                                       ▀▄ ▄▀ 
▀▄ ▄▀       BY ALI NOFEL                    ▀▄ ▄▀ 
▀▄ ▄▀ BY ALI NOFEL (@ali_nofel)             ▀▄ ▄▀          
▀▄ ▄▀ JUST WRITED BY ALI NOFEL              ▀▄ ▄▀   
▀▄ ▄▀          dev   : المطور               ▀▄ ▄▀ 
▀▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀
—]] 
do

function run(msg, matches)
return [[

⚜الـبـوت الـذي يـعـمـل عـلـى مـجـمـوعـات الـسـوبـر 

⚜يـعـمـل الـبـوت عـلـى مـجـمـوعـات سـوبـر تـصـل الـى 5 K عـضـو 

   ≪ تـم صـنـع الـبـوت بـواسـطـه الـمـطـور ≫
   
                      『  @ali_nofel 』
                      
⚜الـمـطـور :  > @ali_nofel
                      

                      
        
                      
⚜للاسـتفـسـار راسـل الـمـطـور :                                     
                     ♕⤵️رآآآفـہہضّي⇣❃🔹
                     
                     Programmable bot : @rafidebot⚜
                     
                     Bot continues coder : @rafidebot ▫️
]]
end

return {
description = "Shows bot q", 
usage = "spam Shows bot q",
patterns = {
"^(المطور)$",
},
run = run 
}
end
